YuZane/ExpressTrain/Device/MM32F5330/Include/reg_i2c.h
/***********************************************************************************************************************
    @file     reg_i2c.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
              MM32 FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_I2C_H
#define __REG_I2C_H

/* Files includes ------------------------------------------------------------*/
#include "core_starmc1.h"

#if defined(__CC_ARM)
#pragma anon_unions
#endif

/**
  * @brief I2C Base Address Definition
  */
#define I2C1_BASE                       (APB1PERIPH_BASE + 0x5400) /*!< Base Address: 0x40005400 */
#define I2C2_BASE                       (APB1PERIPH_BASE + 0x5800) /*!< Base Address: 0x40005800 */

/**
  * @brief I2C Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR;                  /*!< Control Register                               offset: 0x00 */
    __IO uint32_t TAR;                 /*!< Target Address Register                        offset: 0x04 */
    __IO uint32_t SAR;                 /*!< Slave Address Register                         offset: 0x08 */
    __IO uint32_t RESERVED;            /*!< Reserved Register                              offset: 0x0C */
    __IO uint32_t DR;                  /*!< Data Command Register                          offset: 0x10 */
    __IO uint32_t SSHR;                /*!< SCL High Period Count for Std. Speed Register  offset: 0x14 */
    __IO uint32_t SSLR;                /*!< SCL Low Period Count for Std. Speed Register   offset: 0x18 */
    __IO uint32_t FSHR;                /*!< SCL High Period Count for Fast Speed Register  offset: 0x1C */
    __IO uint32_t FSLR;                /*!< SCL Low Period Count for Fast Speed Register   offset: 0x20 */
    __IO uint32_t RESERVED0x24;        /*!< Reserved Register                              offset: 0x24 */
    __IO uint32_t RESERVED0x28;        /*!< Reserved Register                              offset: 0x28 */
    __IO uint32_t ISR;                 /*!< Interrupt Status Register                      offset: 0x2C */
    __IO uint32_t IMR;                 /*!< Interrupt Mask Register                        offset: 0x30 */
    __IO uint32_t RAWISR;              /*!< RAW Interrupt Status Register                  offset: 0x34 */
    __IO uint32_t RXTLR;               /*!< Receive FIFO Threshold Level Register          offset: 0x38 */
    __IO uint32_t TXTLR;               /*!< Transmit FIFO Threshold Level Register         offset: 0x3C */
    __IO uint32_t ICR;                 /*!< Clear All Interrupt Register                   offset: 0x40 */
    __IO uint32_t RX_UNDER;            /*!< Clear RX_UNDER Interrupt Register              offset: 0x44 */
    __IO uint32_t RX_OVER;             /*!< Clear RX_OVER Interrupt Register               offset: 0x48 */
    __IO uint32_t TX_OVER;             /*!< Clear TX_OVER Interrupt Register               offset: 0x4C */
    __IO uint32_t RD_REQ;              /*!< Clear RD_REQ Interrupt Register                offset: 0x50 */
    __IO uint32_t TX_ABRT;             /*!< Clear TX_ABRT Interrupt Register               offset: 0x54 */
    __IO uint32_t RX_DONE;             /*!< Clear RX_DONE Interrupt Register               offset: 0x58 */
    __IO uint32_t ACTIV;               /*!< Clear ACTIVITY Interrupt Register              offset: 0x5C */
    __IO uint32_t STOP;                /*!< Clear STOP_DET Interrupt Register              offset: 0x60 */
    __IO uint32_t START;               /*!< Clear START_DET Interrupt Register             offset: 0x64 */
    __IO uint32_t GC;                  /*!< Clear GEN_CALL Interrupt Register              offset: 0x68 */
    __IO uint32_t ENR;                 /*!< Enable Register                                offset: 0x6C */
    __IO uint32_t SR;                  /*!< Status Register                                offset: 0x70 */
    __IO uint32_t TXFLR;               /*!< Transmit FIFO Level Register                   offset: 0x74 */
    __IO uint32_t RXFLR;               /*!< Receive FIFO Level Register                    offset: 0x78 */
    __IO uint32_t HOLD;                /*!< SDA Hold Time Register                         offset: 0x7C */
    __IO uint32_t TX_ABRT_SRC;         /*!< IC_TX_ABRT_SOURCE_RESERVED;                    offset: 0x80 */
    __IO uint32_t SLV_NACK;            /*!< IC_SLV_DATA_NACK_ONLY_RESERVED;                offset: 0x84 */
    __IO uint32_t DMA;                 /*!< DMA Control Register                           offset: 0x88 */
    __IO uint32_t RESERVED30;          /*!< IC_DMA_TDLR_RESERVED; */
    __IO uint32_t RESERVED31;          /*!< IC_DMA_RDLR_RESERVED; */
    __IO uint32_t SETUP;               /*!< SDA Setup Time Register                        offset: 0x94 */
    __IO uint32_t GCR;                 /*!< ACK General Call Register                      offset: 0x98 */
    __IO uint32_t EN_SR;               /*!< ENABLE status register;                        offset: 0x9C */
    __IO uint32_t SPKLEN;              /*!< Filter register;                               offset: 0xA0 */
    __IO uint32_t RESERVED34;          /*!< _RESERVED;                                     offset: 0xA4 */
    __IO uint32_t RESERVED35;          /*!< _RESERVED;                                     offset: 0xA8 */
    __IO uint32_t SCL_TMO;             /*!< SCL low-level timeout register                 offset: 0xAC */
    __IO uint32_t SDA_TMO;             /*!< SDA low-level timeout register                 offset: 0xB0 */
    __IO uint32_t SCL_STUCK;           /*!< Clear SCL_ STUCK interrupt register            offset: 0xB4 */
    __IO uint32_t RESERVED0xB8;        /*!<                                                offset: 0xB8 */
    __IO uint32_t SMB_SEXT;            /*!< SMBus slave device clock extension timeout register  offset: 0xBC */
    __IO uint32_t SMB_MEXT;            /*!< SMBus master device clock extension timeout register offset: 0xC0 */
    __IO uint32_t SMB_IDLE;            /*!< SMBus bus idle count register                  offset: 0xC4 */
    __IO uint32_t SMB_ISR;             /*!< SMBus interrupt status register                offset: 0xC8 */
    __IO uint32_t SMB_IMR;             /*!< SMBus interrupt mask register                  offset: 0xCC */
    __IO uint32_t SMB_RAWISR;          /*!< SMBus RAW interrupt register                   offset: 0xD0 */
    __IO uint32_t SMB_ICR;             /*!< SMBus combination and independent interrupt clear register offset: 0xD4 */
    __IO uint32_t OPT_SAR;             /*!< Optional slave address register                offset: 0xD8 */
    __IO uint32_t SMB_UDID_LSB;        /*!< SMBus UDID LSB register                        offset: 0xDC */
    __IO uint32_t SMB_UDID_MSB0;       /*!< SMBus UDID MSB register 0                      offset: 0xE0 */
    __IO uint32_t SMB_UDID_MSB1;       /*!< SMBus UDID MSB register 1                      offset: 0xE4 */
    __IO uint32_t SMB_UDID_MSB2;       /*!< SMBus UDID MSB register 2                      offset: 0xE8 */
    __IO uint32_t SLVMASK;             /*!< Slave address mask register                    offset: 0xEC */
    __IO uint32_t SLVRCVADDR;          /*!< Receive address register from device           offset: 0xF0 */
} I2C_TypeDef;

/**
  * @brief I2C type pointer Definition
  */
#define I2C1                                ((I2C_TypeDef *)I2C1_BASE)
#define I2C2                                ((I2C_TypeDef *)I2C2_BASE)

/**
  * @brief I2C_CR Register Bit Definition
  */
#define I2C_CR_MASTER_Pos                   (0)
#define I2C_CR_MASTER_Msk                   (0x01U << I2C_CR_MASTER_Pos)           /*!< I2C master mode enable */
#define I2C_CR_SPEED_Pos                    (1)
#define I2C_CR_SPEED_Msk                    (0x03U << I2C_CR_SPEED_Pos)            /*!< I2C speed mode */
#define I2C_CR_STD                          (0x01U << I2C_CR_SPEED_Pos)            /*!< I2C standard speed mode */
#define I2C_CR_FAST                         (0x02U << I2C_CR_SPEED_Pos)            /*!< I2C fast speed mode */
#define I2C_CR_SLAVE10_Pos                  (3)
#define I2C_CR_SLAVE10_Msk                  (0x01U << I2C_CR_SLAVE10_Pos)          /*!< I2C slave mode responds to 10-bit address */
#define I2C_CR_MASTER10_Pos                 (4)
#define I2C_CR_MASTER10_Msk                 (0x01U << I2C_CR_MASTER10_Pos)         /*!< I2C master mode responds to 10-bit address */
#define I2C_CR_REPEN_Pos                    (5)
#define I2C_CR_REPEN_Msk                    (0x01U << I2C_CR_REPEN_Pos)            /*!< Enable send RESTART */
#define I2C_CR_DISSLAVE_Pos                 (6)
#define I2C_CR_DISSLAVE_Msk                 (0x01U << I2C_CR_DISSLAVE_Pos)         /*!< I2C slave mode disable */
#define I2C_CR_STOPINT_Pos                  (7)
#define I2C_CR_STOPINT_Msk                  (0x01U << I2C_CR_STOPINT_Pos)          /*!< Generate STOP interrupt in slave mode */
#define I2C_CR_EMPINT_Pos                   (8)
#define I2C_CR_EMPINT_Msk                   (0x01U << I2C_CR_EMPINT_Pos)           /*!< I2C TX_EMPTY interrupt */

