YuZane/ExpressTrain/Device/MM32F5330/Include/reg_i2c.h
#define I2C_CR_STOP_Pos                     (9)
#define I2C_CR_STOP_Msk                     (0x01U << I2C_CR_STOP_Pos)             /*!< STOP signal enable */
#define I2C_CR_RESTART_Pos                  (10)
#define I2C_CR_RESTART_Msk                  (0x01U << I2C_CR_RESTART_Pos)          /*!< RESTART signal enable */
#define I2C_CR_SLV_TX_ABRT_DIS_Pos          (11)
#define I2C_CR_SLV_TX_ABRT_DIS_Msk          (0x01U << I2C_CR_SLV_TX_ABRT_DIS_Pos)  /*!< Prohibit clearing TXFIFO after receiving RD_REQ signal */
#define I2C_CR_PAD_SEL_Pos                  (12)
#define I2C_CR_PAD_SEL_Msk                  (0x01U << I2C_CR_PAD_SEL_Pos)          /*!< pad0 select sda;pad1 select scl */
#define I2C_CR_OPT_SAR_EN_Pos               (16)
#define I2C_CR_OPT_SAR_EN_Msk               (0x01U << I2C_CR_OPT_SAR_EN_Pos)       /*!< Enable/DISABLE OPT_ SAR register */
#define I2C_CR_SMB_SLV_QC_EN_Pos            (17)
#define I2C_CR_SMB_SLV_QC_EN_Msk            (0x01U << I2C_CR_SMB_SLV_QC_EN_Pos)    /*!< Receive all commands except fast commands from the device in SMBus mode */
#define I2C_CR_SMB_ARP_EN_Pos               (18)
#define I2C_CR_SMB_ARP_EN_Msk               (0x01U << I2C_CR_SMB_ARP_EN_Pos)       /*!< Decode and respond to address resolution protocol (ARP) commands in SMBus mode */
#define I2C_CR_SMB_PSA_EN_Pos               (19)
#define I2C_CR_SMB_PSA_EN_Msk               (0x01U << I2C_CR_SMB_PSA_EN_Pos)       /*!<  persistent slave */
#define I2C_CR_STOP_DET_MST_ACT_Pos         (20)
#define I2C_CR_STOP_DET_MST_ACT_Msk         (0x01U << I2C_CR_STOP_DET_MST_ACT_Pos) /*!< Stop interrupt generated */
#define I2C_CR_BUS_CLR_Pos                  (21)
#define I2C_CR_BUS_CLR_Msk                  (0x01U << I2C_CR_BUS_CLR_Pos)          /*!< Bus clear enable */
#define I2C_CR_RX_FULL_HLD_Pos              (22)
#define I2C_CR_RX_FULL_HLD_Msk              (0x01U << I2C_CR_RX_FULL_HLD_Pos)      /*!< RX FIFO MODE */

/**
  * @brief I2C_TAR Register Bit Definition
  */
#define I2C_TAR_ADDR_Pos                    (0)
#define I2C_TAR_ADDR_Msk                    (0x03FFU << I2C_TAR_ADDR_Pos)  /*!< Target address for master mode */
#define I2C_TAR_GC_Pos                      (10)
#define I2C_TAR_GC_Msk                      (0x01U << I2C_TAR_GC_Pos)      /*!< General Call or START byte */
#define I2C_TAR_SPECIAL_Pos                 (11)
#define I2C_TAR_SPECIAL_Msk                 (0x01U << I2C_TAR_SPECIAL_Pos) /*!< Special command enable like General Call or START byte */
#define I2C_TAR_SMB_QC_Pos                  (16)
#define I2C_TAR_SMB_QC_Msk                  (0x01U << I2C_TAR_SMB_QC_Pos)  /*!< This bit indicates whether the I2C executes a fast command */

/**
  * @brief I2C_SAR Register Bit Definition
  */
#define I2C_SAR_ADDR_Pos                    (0)
#define I2C_SAR_ADDR_Msk                    (0x03FFU << I2C_SAR_ADDR_Pos) /*!< Slave address */

/**
  * @brief I2C_DR Register Bit Definition
  */
#define I2C_DR_DAT_Pos                      (0)
#define I2C_DR_DAT_Msk                      (0xFFU << I2C_DR_DAT_Pos)        /*!< The data to be transmitted or received */
#define I2C_DR_CMD_Pos                      (8)
#define I2C_DR_CMD_Msk                      (0x01U << I2C_DR_CMD_Pos)        /*!< Read or write command */
#define I2C_DR_FIRST_DATA_Pos               (11)
#define I2C_DR_FIRST_DATA_Msk               (0x01U << I2C_DR_FIRST_DATA_Pos) /*!< Set when the first data byte is received after address transmission */

/**
  * @brief I2C_SSHR Register Bit Definition
  */
#define I2C_SSHR_CNT_Pos                    (0)
#define I2C_SSHR_CNT_Msk                    (0xFFFFU << I2C_SSHR_CNT_Pos) /*!< SCL clock high period count for standard speed */

/**
  * @brief I2C_SSLR Register Bit Definition
  */
#define I2C_SSLR_CNT_Pos                    (0)
#define I2C_SSLR_CNT_Msk                    (0xFFFFU << I2C_SSLR_CNT_Pos) /*!< SCL clock low period count for standard speed */

/**
  * @brief I2C_FSHR Register Bit Definition
  */
#define I2C_FSHR_CNT_Pos                    (0)
#define I2C_FSHR_CNT_Msk                    (0xFFFFU << I2C_FSHR_CNT_Pos) /*!< SCL clock high period count for fast speed */

/**
  * @brief I2C_FSLR Register Bit Definition
  */
#define I2C_FSLR_CNT_Pos                    (0)
#define I2C_FSLR_CNT_Msk                    (0xFFFFU << I2C_FSLR_CNT_Pos) /*!< SCL clock low period count for fast speed */

/**
  * @brief I2C_ISR Register Bit Definition
  */
#define I2C_ISR_R_RX_UNDER_Pos              (0)
#define I2C_ISR_R_RX_UNDER_Msk              (0x01U << I2C_ISR_R_RX_UNDER_Pos)         /*!< RX_UNDER interrupt status */
#define I2C_ISR_R_RX_OVER_Pos               (1)
#define I2C_ISR_R_RX_OVER_Msk               (0x01U << I2C_ISR_R_RX_OVER_Pos)          /*!< RX_OVER interrupt status */
#define I2C_ISR_R_RX_FULL_Pos               (2)
#define I2C_ISR_R_RX_FULL_Msk               (0x01U << I2C_ISR_R_RX_FULL_Pos)          /*!< RX_FULL interrupt status */
#define I2C_ISR_R_TX_OVER_Pos               (3)
#define I2C_ISR_R_TX_OVER_Msk               (0x01U << I2C_ISR_R_TX_OVER_Pos)          /*!< TX_OVER interrupt status */
#define I2C_ISR_R_TX_EMPTY_Pos              (4)
#define I2C_ISR_R_TX_EMPTY_Msk              (0x01U << I2C_ISR_R_TX_EMPTY_Pos)         /*!< TX_EMPTY interrupt status */
#define I2C_ISR_R_RD_REQ_Pos                (5)
#define I2C_ISR_R_RD_REQ_Msk                (0x01U << I2C_ISR_R_RD_REQ_Pos)           /*!< RD_REQ interrupt status */
#define I2C_ISR_R_TX_ABRT_Pos               (6)
#define I2C_ISR_R_TX_ABRT_Msk               (0x01U << I2C_ISR_R_TX_ABRT_Pos)          /*!< TX_ABRT interrupt status */
#define I2C_ISR_R_RX_DONE_Pos               (7)
#define I2C_ISR_R_RX_DONE_Msk               (0x01U << I2C_ISR_R_RX_DONE_Pos)          /*!< RX_DONE interrupt status */
#define I2C_ISR_R_ACTIV_Pos                 (8)
#define I2C_ISR_R_ACTIV_Msk                 (0x01U << I2C_ISR_R_ACTIV_Pos)            /*!< ACTIVITY interrupt status */
#define I2C_ISR_R_STOP_Pos                  (9)
#define I2C_ISR_R_STOP_Msk                  (0x01U << I2C_ISR_R_STOP_Pos)             /*!< STOP_DET interrupt status */
#define I2C_ISR_R_START_Pos                 (10)
#define I2C_ISR_R_START_Msk                 (0x01U << I2C_ISR_R_START_Pos)            /*!< START_DET interrupt status */
#define I2C_ISR_R_GC_Pos                    (11)
#define I2C_ISR_R_GC_Msk                    (0x01U << I2C_ISR_R_GC_Pos)               /*!< GEN_CALL interrupt status */
#define I2C_ISR_R_MST_ON_HOLD_Pos           (13)
#define I2C_ISR_R_MST_ON_HOLD_Msk           (0x01U << I2C_ISR_R_MST_ON_HOLD_Pos)      /*!< MST_ON_HOLD interrupt status */
#define I2C_ISR_R_SCL_STUCK_AT_LOW_Pos      (14)
#define I2C_ISR_R_SCL_STUCK_AT_LOW_Msk      (0x01U << I2C_ISR_R_SCL_STUCK_AT_LOW_Pos) /*!< SCL_STUCK_AT_LOW interrupt status */

/**
  * @brief I2C_IMR Register Bit Definition
  */
#define I2C_IMR_M_RX_UNDER_Pos              (0)
#define I2C_IMR_M_RX_UNDER_Msk              (0x01U << I2C_IMR_M_RX_UNDER_Pos)    /*!< RX_UNDER interrupt status */
#define I2C_IMR_M_RX_OVER_Pos               (1)
#define I2C_IMR_M_RX_OVER_Msk               (0x01U << I2C_IMR_M_RX_OVER_Pos)     /*!< RX_OVER interrupt status */
#define I2C_IMR_M_RX_FULL_Pos               (2)
#define I2C_IMR_M_RX_FULL_Msk               (0x01U << I2C_IMR_M_RX_FULL_Pos)     /*!< RX_FULL interrupt status */
#define I2C_IMR_M_TX_OVER_Pos               (3)
#define I2C_IMR_M_TX_OVER_Msk               (0x01U << I2C_IMR_M_TX_OVER_Pos)     /*!< TX_OVER interrupt status */
#define I2C_IMR_M_TX_EMPTY_Pos              (4)
#define I2C_IMR_M_TX_EMPTY_Msk              (0x01U << I2C_IMR_M_TX_EMPTY_Pos)    /*!< TX_EMPTY interrupt status */
#define I2C_IMR_M_RD_REQ_Pos                (5)
#define I2C_IMR_M_RD_REQ_Msk                (0x01U << I2C_IMR_M_RD_REQ_Pos)      /*!< RD_REQ interrupt status */
#define I2C_IMR_M_TX_ABRT_Pos               (6)
#define I2C_IMR_M_TX_ABRT_Msk               (0x01U << I2C_IMR_M_TX_ABRT_Pos)     /*!< TX_ABRT interrupt status */
#define I2C_IMR_M_RX_DONE_Pos               (7)
#define I2C_IMR_M_RX_DONE_Msk               (0x01U << I2C_IMR_M_RX_DONE_Pos)     /*!< RX_DONE interrupt status */
#define I2C_IMR_M_ACTIV_Pos                 (8)
#define I2C_IMR_M_ACTIV_Msk                 (0x01U << I2C_IMR_M_ACTIV_Pos)       /*!< ACTIVITY interrupt status */
#define I2C_IMR_M_STOP_Pos                  (9)
#define I2C_IMR_M_STOP_Msk                  (0x01U << I2C_IMR_M_STOP_Pos)        /*!< STOP_DET interrupt status */
#define I2C_IMR_M_START_Pos                 (10)
#define I2C_IMR_M_START_Msk                 (0x01U << I2C_IMR_M_START_Pos)       /*!< START_DET interrupt status */
#define I2C_IMR_M_GC_Pos                    (11)
#define I2C_IMR_M_GC_Msk                    (0x01U << I2C_IMR_M_GC_Pos)          /*!< GEN_CALL interrupt status */
#define I2C_IMR_M_MST_ON_HOLD_Pos           (13)
#define I2C_IMR_M_MST_ON_HOLD_Msk           (0x01U << I2C_IMR_M_MST_ON_HOLD_Pos) /*!< MST_ON_HOLD interrupt status */
#define I2C_IMR_M_SCL_STUCK_Pos             (14)
#define I2C_IMR_M_SCL_STUCK_Msk             (0x01U << I2C_IMR_M_SCL_STUCK_Pos)   /*!< SCL_STUCK_AT_LOW interrupt status */

/**
  * @brief I2C_RAWISR Register Bit Definition
  */
#define I2C_RAWISR_RX_UNDER_Pos             (0)
#define I2C_RAWISR_RX_UNDER_Msk             (0x01U << I2C_RAWISR_RX_UNDER_Pos)    /*!< RX_UNDER raw interrupt status */
#define I2C_RAWISR_RX_OVER_Pos              (1)
#define I2C_RAWISR_RX_OVER_Msk              (0x01U << I2C_RAWISR_RX_OVER_Pos)     /*!< RX_OVER raw interrupt status */
#define I2C_RAWISR_RX_FULL_Pos              (2)
#define I2C_RAWISR_RX_FULL_Msk              (0x01U << I2C_RAWISR_RX_FULL_Pos)     /*!< RX_FULL raw interrupt status */
#define I2C_RAWISR_TX_OVER_Pos              (3)
#define I2C_RAWISR_TX_OVER_Msk              (0x01U << I2C_RAWISR_TX_OVER_Pos)     /*!< TX_OVER raw interrupt status */
#define I2C_RAWISR_TX_EMPTY_Pos             (4)
#define I2C_RAWISR_TX_EMPTY_Msk             (0x01U << I2C_RAWISR_TX_EMPTY_Pos)    /*!< TX_EMPTY raw interrupt status */
#define I2C_RAWISR_RD_REQ_Pos               (5)
#define I2C_RAWISR_RD_REQ_Msk               (0x01U << I2C_RAWISR_RD_REQ_Pos)      /*!< RD_REQ raw interrupt status */
#define I2C_RAWISR_TX_ABRT_Pos              (6)
#define I2C_RAWISR_TX_ABRT_Msk              (0x01U << I2C_RAWISR_TX_ABRT_Pos)     /*!< TX_ABRT raw interrupt status */
#define I2C_RAWISR_RX_DONE_Pos              (7)
#define I2C_RAWISR_RX_DONE_Msk              (0x01U << I2C_RAWISR_RX_DONE_Pos)     /*!< RX_DONE raw interrupt status */

#define I2C_RAWISR_ACTIV_Pos                (8)
#define I2C_RAWISR_ACTIV_Msk                (0x01U << I2C_RAWISR_ACTIV_Pos)       /*!< ACTIVITY interrupt status */
#define I2C_RAWISR_STOP_Pos                 (9)
#define I2C_RAWISR_STOP_Msk                 (0x01U << I2C_RAWISR_STOP_Pos)        /*!< STOP_DET interrupt status */
#define I2C_RAWISR_START_Pos                (10)
#define I2C_RAWISR_START_Msk                (0x01U << I2C_RAWISR_START_Pos)       /*!< START_DET interrupt status */
#define I2C_RAWISR_GC_Pos                   (11)
#define I2C_RAWISR_GC_Msk                   (0x01U << I2C_RAWISR_GC_Pos)          /*!< GEN_CALL interrupt status */
#define I2C_RAWISR_MST_ON_HOLD_Pos          (13)
#define I2C_RAWISR_MST_ON_HOLD_Msk          (0x01U << I2C_RAWISR_MST_ON_HOLD_Pos) /*!< MST_ON_HOLD interrupt status */
#define I2C_RAWISR_SCL_STUCK_Pos            (14)
#define I2C_RAWISR_SCL_STUCK_Msk            (0x01U << I2C_RAWISR_SCL_STUCK_Pos)   /*!< SCL_STUCK_AT_LOW interrupt status */

/**
  * @brief I2C_RXTLR Register Bit Definition
  */
#define I2C_RXTLR_TL_Pos                    (0)
#define I2C_RXTLR_TL_Msk                    (0x03U << I2C_RXTLR_TL_Pos) /*!< Receive FIFO threshold level */

/**
  * @brief I2C_TXTLR Register Bit Definition
  */
#define I2C_TXTLR_TL_Pos                    (0)
#define I2C_TXTLR_TL_Msk                    (0x03U << I2C_TXTLR_TL_Pos) /*!< Transmit FIFO threshold level */

/**
  * @brief I2C_ICR Register Bit Definition
  */
#define I2C_ICR_Pos                         (0)
#define I2C_ICR_Msk                         (0x01U << I2C_ICR_Pos) /*!< Read this register to clear the combined interrupt, all individual interrupts */

/**
  * @brief I2C_RX_UNDER Register Bit Definition
  */
#define I2C_RX_UNDER_Pos                    (0)
#define I2C_RX_UNDER_Msk                    (0x01U << I2C_RX_UNDER_Pos) /*!< Read this register to clear the RX_UNDER interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_RX_OVER Register Bit Definition
  */
#define I2C_RX_OVER_Pos                     (0)
#define I2C_RX_OVER_Msk                     (0x01U << I2C_RX_OVER_Pos) /*!< Read this register to clear the RX_OVER interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_TX_OVER Register Bit Definition
  */
#define I2C_TX_OVER_Pos                     (0)
#define I2C_TX_OVER_Msk                     (0x01U << I2C_TX_OVER_Pos) /*!< Read this register to clear the TX_OVER interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_RD_REQ Register Bit Definition
  */
#define I2C_RD_REQ_Pos                      (0)
#define I2C_RD_REQ_Msk                      (0x01U << I2C_RD_REQ_Pos) /*!< Read this register to clear the RD_REQ interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_TX_ABRT Register Bit Definition
  */
#define I2C_TX_ABRT_Pos                     (0)
#define I2C_TX_ABRT_Msk                     (0x01U << I2C_TX_ABRT_Pos) /*!< Read this register to clear the TX_ABRT interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_RX_DONE Register Bit Definition
  */
#define I2C_RX_DONE_Pos                     (0)
#define I2C_RX_DONE_Msk                     (0x01U << I2C_RX_DONE_Pos) /*!< Read this register to clear the RX_DONE interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_ACTIV Register Bit Definition
  */
#define I2C_ACTIV_Pos                       (0)
#define I2C_ACTIV_Msk                       (0x01U << I2C_ACTIV_Pos) /*!< Read this register to clear the ACTIVITY interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_STOP Register Bit Definition
  */
#define I2C_STOP_Pos                        (0)
#define I2C_STOP_Msk                        (0x01U << I2C_STOP_Pos) /*!< Read this register to clear the STOP_DET interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_START Register Bit Definition
  */
#define I2C_START_Pos                       (0)
#define I2C_START_Msk                       (0x01U << I2C_START_Pos) /*!< Read this register to clear the START_DET interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_GC Register Bit Definition
  */
#define I2C_GC_Pos                          (0)
#define I2C_GC_Msk                          (0x01U << I2C_GC_Pos) /*!< Read this register to clear the GEN_CALL interrupt of the I2C_RAW_INTR_STAT register */

/**
  * @brief I2C_ENR Register Bit Definition
  */
#define I2C_ENR_ENABLE_Pos                  (0)
#define I2C_ENR_ENABLE_Msk                  (0x01U << I2C_ENR_ENABLE_Pos)       /*!< I2C mode enable */
#define I2C_ENR_ABORT_Pos                   (1)
#define I2C_ENR_ABORT_Msk                   (0x01U << I2C_ENR_ABORT_Pos)        /*!< I2C transfer abort */
#define I2C_ENR_TX_CMD_BLOCK_Pos            (2)
#define I2C_ENR_TX_CMD_BLOCK_Msk            (0x01U << I2C_ENR_TX_CMD_BLOCK_Pos) /*!< TX_CMD_BLOCK */
#define I2C_ENR_SDA_RCV_EN_Pos              (3)
#define I2C_ENR_SDA_RCV_EN_Msk              (0x01U << I2C_ENR_SDA_RCV_EN_Pos)   /*!< Enable SDA recovery mechanism */
#define I2C_ENR_SMB_CLK_RST_Pos             (16)
#define I2C_ENR_SMB_CLK_RST_Msk             (0x01U << I2C_ENR_SMB_CLK_RST_Pos)  /*!< SMBus master clock reset */
#define I2C_ENR_SMB_ALT_EN_Pos              (18)
#define I2C_ENR_SMB_ALT_EN_Msk              (0x01U << I2C_ENR_SMB_ALT_EN_Pos)   /*!< SMBus alarm enable */

/**
  * @brief I2C_SR Register Bit Definition
  */
#define I2C_SR_ACTIV_Pos                    (0)
#define I2C_SR_ACTIV_Msk                    (0x01U << I2C_SR_ACTIV_Pos)             /*!< I2C activity status */
#define I2C_SR_TFNF_Pos                     (1)
#define I2C_SR_TFNF_Msk                     (0x01U << I2C_SR_TFNF_Pos)              /*!< Transmit FIFO not full */
#define I2C_SR_TFE_Pos                      (2)
#define I2C_SR_TFE_Msk                      (0x01U << I2C_SR_TFE_Pos)               /*!< Transmit FIFO completely empty */
#define I2C_SR_RFNE_Pos                     (3)
#define I2C_SR_RFNE_Msk                     (0x01U << I2C_SR_RFNE_Pos)              /*!< Receive FIFO not empty */
#define I2C_SR_RFF_Pos                      (4)
#define I2C_SR_RFF_Msk                      (0x01U << I2C_SR_RFF_Pos)               /*!< Receive FIFO completely full */
#define I2C_SR_MST_ACTIV_Pos                (5)
#define I2C_SR_MST_ACTIV_Msk                (0x01U << I2C_SR_MST_ACTIV_Pos)         /*!< Master FSM activity status */
#define I2C_SR_SLV_ACTIV_Pos                (6)
#define I2C_SR_SLV_ACTIV_Msk                (0x01U << I2C_SR_SLV_ACTIV_Pos)         /*!< Slave FSM activity status */
#define I2C_SR_MST_HOLD_TX_EMPTY_Pos        (7)
#define I2C_SR_MST_HOLD_TX_EMPTY_Msk        (0x01U << I2C_SR_MST_HOLD_TX_EMPTY_Pos) /*!< Set when the main device is in the hold state because TX FIFO is empty */
#define I2C_SR_MST_HOLD_RX_FULL_Pos         (8)
#define I2C_SR_MST_HOLD_RX_FULL_Msk         (0x01U << I2C_SR_MST_HOLD_RX_FULL_Pos)  /*!< Set when the main device is in the hold state due to receiving overload */
#define I2C_SR_SLV_HOLD_TX_EMPTY_Pos        (9)
#define I2C_SR_SLV_HOLD_TX_EMPTY_Msk        (0x01U << I2C_SR_SLV_HOLD_TX_EMPTY_Pos) /*!< Set when the slave device is in the hold state because TX FIFO is empty when receiving the read request */
#define I2C_SR_SLV_HOLD_RX_FULL_Pos         (10)
#define I2C_SR_SLV_HOLD_RX_FULL_Msk         (0x01U << I2C_SR_SLV_HOLD_RX_FULL_Pos)  /*!< Set when the slave device is in the hold state due to receiving overload */
#define I2C_SR_SDA_NOT_RECOVERED_Pos        (11)
#define I2C_SR_SDA_NOT_RECOVERED_Msk        (0x01U << I2C_SR_SDA_NOT_RECOVERED_Pos) /*!< After the recovery mechanism is enabled, the SDA is set when it is not recovered */
#define I2C_SR_SMB_QC_Pos                   (16)
#define I2C_SR_SMB_QC_Msk                   (0x01U << I2C_SR_SMB_QC_Pos)            /*!< SMBus fast command status bit */
#define I2C_SR_SMB_SLV_AV_Pos               (17)
#define I2C_SR_SMB_SLV_AV_Msk               (0x01U << I2C_SR_SMB_SLV_AV_Pos)        /*!< SMBus Slave address Valid */
#define I2C_SR_SMB_SLV_AR_Pos               (18)
#define I2C_SR_SMB_SLV_AR_Msk               (0x01U << I2C_SR_SMB_SLV_AR_Pos)        /*!< SMBus Slave address Resolved */
#define I2C_SR_SMB_ALT_Pos                  (20)
#define I2C_SR_SMB_ALT_Msk                  (0x01U << I2C_SR_SMB_ALT_Pos)           /*!< SMBus alarm status bit */

/**
  * @brief I2C_TXFLR Register Bit Definition
  */
#define I2C_TXFLR_CNT_Pos                   (0)
#define I2C_TXFLR_CNT_Msk                   (0x07U << I2C_TXFLR_CNT_Pos) /*!< Number of valid data in the transmit FIFO */

/**
  * @brief I2C_RXFLR Register Bit Definition
  */
#define I2C_RXFLR_CNT_Pos                   (0)
#define I2C_RXFLR_CNT_Msk                   (0x07U << I2C_RXFLR_CNT_Pos) /*!< Number of valid data in the receive FIFO */

/**
  * @brief I2C_HOLD Register Bit Definition
  */
#define I2C_HOLD_TX_HOLD_Pos                (0)
#define I2C_HOLD_TX_HOLD_Msk                (0xFFFFU << I2C_HOLD_TX_HOLD_Pos) /*!< SDA hold time when I2C acts as a transmit */
#define I2C_HOLD_RX_HOLD_Pos                (16)
#define I2C_HOLD_RX_HOLD_Msk                (0xFFU << I2C_HOLD_RX_HOLD_Pos)   /*!< SDA hold time when I2C acts as a receiver */

/**
  * @brief I2C_TX_ABRT_SRC Register Bit Definition
  */
#define I2C_TX_ABRT_SRC_7ADDR_NOACK_Pos     (0)
#define I2C_TX_ABRT_SRC_7ADDR_NOACK_Msk     (0x01U << I2C_TX_ABRT_SRC_7ADDR_NOACK_Pos)    /*!< Main device works in 7-bit addressing mode */
#define I2C_TX_ABRT_SRC_10ADDR1_NOACK_Pos   (1)
#define I2C_TX_ABRT_SRC_10ADDR1_NOACK_Msk   (0x01U << I2C_TX_ABRT_SRC_10ADDR1_NOACK_Pos)  /*!< Main device works in 10-bit addressing mode */
#define I2C_TX_ABRT_SRC_10ADDR2_NOACK_Pos   (2)
#define I2C_TX_ABRT_SRC_10ADDR2_NOACK_Msk   (0x01U << I2C_TX_ABRT_SRC_10ADDR2_NOACK_Pos)  /*!< Main device works in 10-bit addressing mode */
#define I2C_TX_ABRT_SRC_TXDATA_NOACK_Pos    (3)
#define I2C_TX_ABRT_SRC_TXDATA_NOACK_Msk    (0x01U << I2C_TX_ABRT_SRC_TXDATA_NOACK_Pos)   /*!< After the master device receives the address response, it is set when no slave device responds to the sent data */
#define I2C_TX_ABRT_SRC_GC_NOACK_Pos        (4)
#define I2C_TX_ABRT_SRC_GC_NOACK_Msk        (0x01U << I2C_TX_ABRT_SRC_GC_NOACK_Pos)       /*!< After the master device sends a broadcast call, it is set when no slave device responds */
#define I2C_TX_ABRT_SRC_GC_READ_Pos         (5)
#define I2C_TX_ABRT_SRC_GC_READ_Msk         (0x01U << I2C_TX_ABRT_SRC_GC_READ_Pos)        /*!< Set when the master device sends a broadcast call and then sends a read request */
#define I2C_TX_ABRT_SRC_SBYTE_ACKDET_Pos    (7)
#define I2C_TX_ABRT_SRC_SBYTE_ACKDET_Msk    (0x01U << I2C_TX_ABRT_SRC_SBYTE_ACKDET_Pos)   /*!< Set when the main device sends the start byte and is responded (error behavior) */
#define I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Pos   (9)
#define I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Msk   (0x01U << I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Pos)  /*!< When RESTART is not enabled (I2C_CR.REPEN is 0), the start byte is sent, and the position bit */
#define I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Pos  (10)
#define I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Msk  (0x01U << I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Pos) /*!< When RESTART is not enabled (I2C_CR.REPEN is 0), the main device is in 10-bit addressing mode If a read request is sent, the position bit */
#define I2C_TX_ABRT_SRC_MST_DIS_Pos         (11)
#define I2C_TX_ABRT_SRC_MST_DIS_Msk         (0x01U << I2C_TX_ABRT_SRC_MST_DIS_Pos)        /*!< If the main device is operated when the main mode is disabled, this position bit */
#define I2C_TX_ABRT_SRC_LOST_Pos            (12)
#define I2C_TX_ABRT_SRC_LOST_Msk            (0x01U << I2C_TX_ABRT_SRC_LOST_Pos)           /*!< Master device arbitration fails, or slave device arbitration fails when bit 14 is set to 1, then this position is */
#define I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Pos (13)
#define I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Msk (0x01U << I2C_TX_ABRT_SRC_LOST_Pos)           /*!< When the slave device receives the read request, there is still data in TX FIFO, and the slave device generates TX through_ ABRT interrupt clears the old data in TX FIFO. */
#define I2C_TX_ABRT_SRC_SLV_ARBLOST_Pos     (14)
#define I2C_TX_ABRT_SRC_SLV_ARBLOST_Msk     (0x01U << I2C_TX_ABRT_SRC_SLV_ARBLOST_Pos)    /*!< If the bus is lost when sending data from the device, this bit and bit 12 are set at the same time */
#define I2C_TX_ABRT_SRC_SLVRD_INTX_Pos      (15)
#define I2C_TX_ABRT_SRC_SLVRD_INTX_Msk      (0x01U << I2C_TX_ABRT_SRC_SLVRD_INTX_Pos)     /*!< From the sending mode, I2C sends data to I2C_ DR.CMD (bit 8) write 1 (read command), then this position bit */
#define I2C_TX_ABRT_SRC_USER_ABRT_Pos       (16)
#define I2C_TX_ABRT_SRC_USER_ABRT_Msk       (0x01U << I2C_TX_ABRT_SRC_USER_ABRT_Pos)      /*!< Set when the master device detects transmission termination (I2C_ENR.ABORT is 1) */
#define I2C_TX_ABRT_SRC_SDA_LOW_Pos         (17)
#define I2C_TX_ABRT_SRC_SDA_LOW_Msk         (0x01U << I2C_TX_ABRT_SRC_USER_ABRT_Pos)      /*!< If the main device detects SDA low level timeout, this position is */
#define I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos    (23)
#define I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Msk    (0x1FFU << I2C_TX_ABRT_SRC_USER_ABRT_Pos)     /*!< Number of data/commands in TX FIFO flushed due to transmission interruption */

