YuZane/ExpressTrain/Device/MM32F5330/Include/reg_i2c.h
/**
  * @brief I2C_SLV_NACK Register Bit Definition
  */
#define I2C_SLV_NACK_Pos                    (0)
#define I2C_SLV_NACK_Msk                    (0x01U << I2C_SLV_NACK_Pos) /*!< NACK is generated after receiving data from the device */

/**
  * @brief I2C_DMA Register Bit Definition
  */
#define I2C_DMA_RXEN_Pos                    (0)
#define I2C_DMA_RXEN_Msk                    (0x01U << I2C_DMA_RXEN_Pos) /*!< Receive DMA enable */
#define I2C_DMA_TXEN_Pos                    (1)
#define I2C_DMA_TXEN_Msk                    (0x01U << I2C_DMA_TXEN_Pos) /*!< Transmit DMA enable */

/**
  * @brief I2C_SETUP Register Bit Definition
  */
#define I2C_SETUP_CNT_Pos                   (0)
#define I2C_SETUP_CNT_Msk                   (0xFFU << I2C_SETUP_CNT_Pos) /*!< SDA setup */

/**
  * @brief I2C_GCR Register Bit Definition
  */
#define I2C_GCR_GC_Pos                      (0)
#define I2C_GCR_GC_Msk                      (0x01U << I2C_GCR_GC_Pos) /*!< ACK general call */

/**
  * @brief I2C_EN_SR Register Bit Definition
  */
#define I2C_EN_SR_IC_EN_Pos                 (0)
#define I2C_EN_SR_IC_EN_Msk                 (0x01U << I2C_EN_SR_IC_EN_Pos)              /*!< I2C is active */
#define I2C_EN_SR_SLV_DIS_WHILE_BUSY_Pos    (1)
#define I2C_EN_SR_SLV_DIS_WHILE_BUSY_Msk    (0x01U << I2C_EN_SR_SLV_DIS_WHILE_BUSY_Pos) /*!< Slave Disabled While Busy */
#define I2C_EN_SR_SLV_RX_DATA_LOST_Pos      (2)
#define I2C_EN_SR_SLV_RX_DATA_LOST_Msk      (0x01U << I2C_EN_SR_SLV_RX_DATA_LOST_Pos)   /*!< Slave Received Data Lost */

/**
  * @brief I2C_SPKLEN Register Bit Definition
  */
#define I2C_SPKLEN_Pos                      (0)
#define I2C_SPKLEN_Msk                      (0xFFU << I2C_SPKLEN_Pos) /*!< Configure spike suppression time, in APB clock cycle The minimum value is 1. */

/**
  * @brief I2C_SCL_TMO Register Bit Definition
  */
#define I2C_SCL_TMO_SCL_TIMEOUT_Pos         (0)
#define I2C_SCL_TMO_SCL_TIMEOUT_Msk         (0xFFFFFFFFU << I2C_SCL_TMO_SCL_TIMEOUT_Pos) /*!< Configure the duration of SCL low-level timeout, in APB clock cycle */

/**
  * @brief I2C_SDA_TMO Register Bit Definition
  */
#define I2C_SDA_TMO_SCL_TIMEOUT_Pos         (0)
#define I2C_SDA_TMO_SCL_TIMEOUT_Msk         (0xFFFFFFFFU << I2C_SDA_TMO_SCL_TIMEOUT_Pos) /*!< Configure the duration of SDA low-level timeout, in APB clock cycle */

/**
  * @brief I2C_SCL_STUCK Register Bit Definition
  */
#define I2C_SCL_STUCK_Pos                   (0)
#define I2C_SCL_STUCK_Msk                   (0x01U << I2C_SCL_STUCK_Pos) /*!< Read this register to clear SCL_ STUCK interrupt */

/**
  * @brief I2C_SMB_SEXT Register Bit Definition
  */
#define I2C_SMB_SEXT_Pos                    (0)
#define I2C_SMB_SEXT_Msk                    (0xFFFFFFFFU << I2C_SMB_SEXT_Pos) /*!< Configure slave device clock extension timeout */

/**
  * @brief I2C_SMB_MEXT Register Bit Definition
  */
#define I2C_SMB_MEXT_Pos                    (0)
#define I2C_SMB_MEXT_Msk                    (0xFFFFFFFFU << I2C_SMB_MEXT_Pos) /*!< Configure the clock extension timeout for the master device to transmit one byte */

/**
  * @brief I2C_SMB_IDLE Register Bit Definition
  */
#define I2C_SMB_IDLE_CNT_Pos                (0)
#define I2C_SMB_IDLE_CNT_Msk                (0xFFFFU << I2C_SMB_IDLE_CNT_Pos) /*!< Configure the required bus idle time */

/**
  * @brief I2C_SMB_ISR Register Bit Definition
  */
#define I2C_SMB_ISR_R_SLV_TMO_Pos           (0)
#define I2C_SMB_ISR_R_SLV_TMO_Msk           (0x01U << I2C_SMB_ISR_R_SLV_TMO_Pos)    /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_MST_TMO_Pos           (1)
#define I2C_SMB_ISR_R_MST_TMO_Msk           (0x01U << I2C_SMB_ISR_R_MST_TMO_Pos)    /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_ARP_QUICK_Pos         (2)
#define I2C_SMB_ISR_R_ARP_QUICK_Msk         (0x01U << I2C_SMB_ISR_R_ARP_QUICK_Pos)  /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_ARP_NOTIFY_Pos        (3)
#define I2C_SMB_ISR_R_ARP_NOTIFY_Msk        (0x01U << I2C_SMB_ISR_R_ARP_NOTIFY_Pos) /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_ARP_PRE_Pos           (4)
#define I2C_SMB_ISR_R_ARP_PRE_Msk           (0x01U << I2C_SMB_ISR_R_ARP_PRE_Pos)    /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_ARP_RST_Pos           (5)
#define I2C_SMB_ISR_R_ARP_RST_Msk           (0x01U << I2C_SMB_ISR_R_ARP_RST_Pos)    /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_ARP_UDID_Pos          (6)
#define I2C_SMB_ISR_R_ARP_UDID_Msk          (0x01U << I2C_SMB_ISR_R_ARP_UDID_Pos)   /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_ARP_ASSGN_Pos         (7)
#define I2C_SMB_ISR_R_ARP_ASSGN_Msk         (0x01U << I2C_SMB_ISR_R_ARP_ASSGN_Pos)  /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_PEC_NACK_Pos          (8)
#define I2C_SMB_ISR_R_PEC_NACK_Msk          (0x01U << I2C_SMB_ISR_R_PEC_NACK_Pos)   /*!< For detailed description, please refer to I2C_SMB_RAWISR register */
#define I2C_SMB_ISR_R_SMB_ALT_Pos           (10)
#define I2C_SMB_ISR_R_SMB_ALT_Msk           (0x01U << I2C_SMB_ISR_R_SMB_ALT_Pos)    /*!< For detailed description, please refer to I2C_SMB_RAWISR register */

/**
  * @brief I2C_SMB_IMR Register Bit Definition
  */
#define I2C_SMB_IMR_M_SLV_TMO_Pos           (0)
#define I2C_SMB_IMR_M_SLV_TMO_Msk           (0x01U << I2C_SMB_IMR_M_SLV_TMO_Pos)    /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_MST_TMO_Pos           (1)
#define I2C_SMB_IMR_M_MST_TMO_Msk           (0x01U << I2C_SMB_IMR_M_MST_TMO_Pos)    /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_ARP_QUICK_Pos         (2)
#define I2C_SMB_IMR_M_ARP_QUICK_Msk         (0x01U << I2C_SMB_IMR_M_ARP_QUICK_Pos)  /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_ARP_NOTIFY_Pos        (3)
#define I2C_SMB_IMR_M_ARP_NOTIFY_Msk        (0x01U << I2C_SMB_IMR_M_ARP_NOTIFY_Pos) /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_ARP_PRE_Pos           (4)
#define I2C_SMB_IMR_M_ARP_PRE_Msk           (0x01U << I2C_SMB_IMR_M_ARP_PRE_Pos)    /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_ARP_RST_Pos           (5)
#define I2C_SMB_IMR_M_ARP_RST_Msk           (0x01U << I2C_SMB_IMR_M_ARP_RST_Pos)    /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_ARP_UDID_Pos          (6)
#define I2C_SMB_IMR_M_ARP_UDID_Msk          (0x01U << I2C_SMB_IMR_M_ARP_UDID_Pos)   /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_ARP_ASSGN_Pos         (7)
#define I2C_SMB_IMR_M_ARP_ASSGN_Msk         (0x01U << I2C_SMB_IMR_M_ARP_ASSGN_Pos)  /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_PEC_NACK_Pos          (8)
#define I2C_SMB_IMR_M_PEC_NACK_Msk          (0x01U << I2C_SMB_IMR_M_PEC_NACK_Pos)   /*!< For detailed description, please refer to I2C_SMB_ISR register */
#define I2C_SMB_IMR_M_SMB_ALT_Pos           (10)
#define I2C_SMB_IMR_M_SMB_ALT_Msk           (0x01U << I2C_SMB_IMR_M_SMB_ALT_Pos)    /*!< For detailed description, please refer to I2C_SMB_ISR register */

/**
  * @brief  I2C_SMB_RAWISR Register Bit Definition
  */
#define I2C_SMB_RAWISR_SLV_TMO_Pos          (0)
#define I2C_SMB_RAWISR_SLV_TMO_Msk          (0x01U << I2C_SMB_RAWISR_SLV_TMO_Pos)    /*!< If the clock extension timeout from the device communication once (START to STOP) is exceeded, this position bit */
#define I2C_SMB_RAWISR_MST_TMO_Pos          (1)
#define I2C_SMB_RAWISR_MST_TMO_Msk          (0x01U << I2C_SMB_RAWISR_MST_TMO_Pos)    /*!< If the master device transmits a byte of clock extension timeout, this position bit */
#define I2C_SMB_RAWISR_ARP_QUICK_Pos        (2)
#define I2C_SMB_RAWISR_ARP_QUICK_Msk        (0x01U << I2C_SMB_RAWISR_ARP_QUICK_Pos)  /*!< Set when receiving Quick command */
#define I2C_SMB_RAWISR_ARP_NOTIFY_Pos       (3)
#define I2C_SMB_RAWISR_ARP_NOTIFY_Msk       (0x01U << I2C_SMB_RAWISR_ARP_NOTIFY_Pos) /*!< Set when receiving the Host Notify command */
#define I2C_SMB_RAWISR_ARP_PRE_Pos          (4)
#define I2C_SMB_RAWISR_ARP_PRE_Msk          (0x01U << I2C_SMB_RAWISR_ARP_PRE_Pos)    /*!< Set when receiving the Prepare to ARP command */
#define I2C_SMB_RAWISR_ARP_RST_Pos          (5)
#define I2C_SMB_RAWISR_ARP_RST_Msk          (0x01U << I2C_SMB_RAWISR_ARP_RST_Pos)    /*!< Set when receiving Reset ARP command */
#define I2C_SMB_RAWISR_ARP_UDID_Pos         (6)
#define I2C_SMB_RAWISR_ARP_UDID_Msk         (0x01U << I2C_SMB_RAWISR_ARP_UDID_Pos)   /*!< Set when receiving the Get UDID ARP command */
#define I2C_SMB_RAWISR_ARP_ASSGN_Pos        (7)
#define I2C_SMB_RAWISR_ARP_ASSGN_Msk        (0x01U << I2C_SMB_RAWISR_ARP_ASSGN_Pos)  /*!< Set when receiving the Assign Address ARP command */
#define I2C_SMB_RAWISR_PEC_NACK_Pos         (8)
#define I2C_SMB_RAWISR_PEC_NACK_Msk         (0x01U << I2C_SMB_RAWISR_PEC_NACK_Pos)   /*!< Set when the slave device does not respond to the PEC byte of the ARP command */
#define I2C_SMB_RAWISR_SMB_ALT_Pos          (10)
#define I2C_SMB_RAWISR_SMB_ALT_Msk          (0x01U << I2C_SMB_RAWISR_SMB_ALT_Pos)    /*!< Set when slave device alarm is detected */

/**
  * @brief I2C_SMB_ICR Register Bit Definition
  */
#define I2C_SMB_ICR_CLR_SLV_TMO_Pos         (0)
#define I2C_SMB_ICR_CLR_SLV_TMO_Msk         (0x01U << I2C_SMB_ICR_CLR_SLV_TMO_Pos)    /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_MST_TMO_Pos         (1)
#define I2C_SMB_ICR_CLR_MST_TMO_Msk         (0x01U << I2C_SMB_ICR_CLR_MST_TMO_Pos)    /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_ARP_QUICK_Pos       (2)
#define I2C_SMB_ICR_CLR_ARP_QUICK_Msk       (0x01U << I2C_SMB_ICR_CLR_ARP_QUICK_Pos)  /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_ARP_NOTIFY_Pos      (3)
#define I2C_SMB_ICR_CLR_ARP_NOTIFY_Msk      (0x01U << I2C_SMB_ICR_CLR_ARP_NOTIFY_Pos) /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_ARP_PRE_Pos         (4)
#define I2C_SMB_ICR_CLR_ARP_PRE_Msk         (0x01U << I2C_SMB_ICR_CLR_ARP_PRE_Pos)    /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_ARP_RST_Pos         (5)
#define I2C_SMB_ICR_CLR_ARP_RST_Msk         (0x01U << I2C_SMB_ICR_CLR_ARP_RST_Pos)    /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_ARP_UDID_Pos        (6)
#define I2C_SMB_ICR_CLR_ARP_UDID_Msk        (0x01U << I2C_SMB_ICR_CLR_ARP_UDID_Pos)   /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_ARP_ASSGN_Pos       (7)
#define I2C_SMB_ICR_CLR_ARP_ASSGN_Msk       (0x01U << I2C_SMB_ICR_CLR_ARP_ASSGN_Pos)  /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_PEC_NACK_Pos        (8)
#define I2C_SMB_ICR_CLR_PEC_NACK_Msk        (0x01U << I2C_SMB_ICR_CLR_PEC_NACK_Pos)   /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */
#define I2C_SMB_ICR_CLR_SMB_ALT_Pos         (10)
#define I2C_SMB_ICR_CLR_SMB_ALT_Msk         (0x01U << I2C_SMB_ICR_CLR_SMB_ALT_Pos)    /*!< Write this bit to clear and I2C_ SMB_ RAWISR corresponding interrupt */

/**
  * @brief I2C_OPT_SAR Register Bit Definition
  */
#define I2C_OPT_SAR_ADDR_Pos                (0)
#define I2C_OPT_SAR_ADDR_Msk                (0x7FU << I2C_OPT_SAR_ADDR_Pos) /*!< Slave address of I2C interface in SMBus slave mode */

/**
  * @brief I2C_SMB_UDID_LSB Register Bit Definition
  */
#define I2C_SMB_UDID_LSB_Pos                (0)
#define I2C_SMB_UDID_LSB_Msk                (0xFFFFFFFFU << I2C_SMB_UDID_LSB_Pos) /*!< Configure SMBus UDID [31:0] */

/**
  * @brief I2C_SMB_UDID_MSB0 Register Bit Definition
  */
#define I2C_SMB_UDID_MSB0_Pos               (0)
#define I2C_SMB_UDID_MSB0_Msk               (0xFFFFFFFFU << I2C_SMB_UDID_MSB0_Pos) /*!< Configure SMBus UDID [63:32] */

/**
  * @brief I2C_SMB_UDID_MSB1 Register Bit Definition
  */
#define I2C_SMB_UDID_MSB1_Pos               (0)
#define I2C_SMB_UDID_MSB1_Msk               (0xFFFFFFFFU << I2C_SMB_UDID_MSB1_Pos) /*!< Configure SMBus UDID [95:64] */

/**
  * @brief I2C_SMB_UDID_MSB2 Register Bit Definition
  */
#define I2C_SMB_UDID_MSB2_Pos               (0)
#define I2C_SMB_UDID_MSB2_Msk               (0xFFFFFFFFU << I2C_SMB_UDID_MSB2_Pos) /*!< Configure SMBus UDID [127:96] */

/**
  * @brief I2C_SLVMASK Register Bit Definition
  */
#define I2C_SLVMASK_MASK_Pos                (0)
#define I2C_SLVMASK_MASK_Msk                (0x3FFU << I2C_SLVMASK_MASK_Pos) /*!< Slave address mask */

/**
  * @brief I2C_SLVRCVADDR Register Bit Definition
  */
#define I2C_SLVRCVADDR_ADDR_Pos             (0)
#define I2C_SLVRCVADDR_ADDR_Msk             (0x3FFU << I2C_SLVRCVADDR_ADDR_Pos) /*!< Address actually received from the device */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/** --------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/

